In [4]:
import pandas as pd

In [31]:
df = pd.DataFrame({'col1':[10,12,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0    10   444  abc
1    12   555  def
2     3   666  ghi
3     4   444  xyz

In [32]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [33]:
df["col2"].nunique()

3

In [34]:
#------------------------------------ MAP

In [35]:
def potenciacion(x):
    return x*x

In [36]:
df["col1"].map(potenciacion)

0    100
1    144
2      9
3     16
Name: col1, dtype: int64

In [44]:
df["col1"].map(lambda x : x**3)

0    1000
1    1728
2      27
3      64
Name: col1, dtype: int64

In [49]:
#---------------------------Nombres de las columnas

In [50]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [57]:
df.describe()

            col1        col2
count   4.000000    4.000000
mean    7.250000  527.250000
std     4.425306  106.274409
min     3.000000  444.000000
25%     3.750000  444.000000
50%     7.000000  499.500000
75%    10.500000  582.750000
max    12.000000  666.000000

In [71]:
#------------------------------- ORDENAR VALORES

In [61]:
df

   col1  col2 col3
0    10   444  abc
1    12   555  def
2     3   666  ghi
3     4   444  xyz

In [67]:
df.sort_values(by="col2")

   col1  col2 col3
0    10   444  abc
3     4   444  xyz
1    12   555  def
2     3   666  ghi

In [70]:
df["col2"].sort_values()

0    444
3    444
1    555
2    666
Name: col2, dtype: int64